# Vertex Class

---
The base class for DirectContext3D vertices.
SystemObject Autodesk.Revit.DB.DirectContext3DVertex Autodesk.Revit.DB.DirectContext3DVertexPosition Autodesk.Revit.DB.DirectContext3DVertexPositionColored Autodesk.Revit.DB.DirectContext3DVertexPositionNormal Autodesk.Revit.DB.DirectContext3DVertexPositionNormalColored
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class Vertex : IDisposable

    Public Class Vertex
    	Implements IDisposable

    public ref class Vertex : IDisposable

    type Vertex =
        class
            interface IDisposable
        end
The Vertex type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the Vertex
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.DirectContext3D Namespace